[
    {
        "id": "_meta",
        "name": "Fragments' Insanity",
        "author": "Wandering Fragments",
        "almanac": "https://quorglepleegjr.github.io/"
    },
    {
        "id": "intuitor",
        "name": "Intuitor",
        "team": "townsfolk",
        "ability": "Each night, learn the character (on or off script) that would help your team the most.",
        "preceedingFirstNightId": "highpriestess",
        "preceedingOtherNightId": "highpriestess",
        "firstNight": 67.5,
        "otherNight": 85.5,
        "firstNightReminder": "Show the Intuitor the character that would help their team the most.",
        "flavor": "Behind every great idea, behind every good thought, is intuition. Hone that, and maybe you too can think the right way.",
        "overview": "The Intuitor learns the most useful characters to their team, whether in play or not.",
        "howtorun": "Each night, wake the Intuitor, and show them the character token for the character you think would be most useful for their team.",
        "examples": [
            "The Intuitor learns Chef: Multiple evil characters are next to eachother.",
            "The Intuitor learns Barista: Critical good players are currently poisoned.",
            "The Intuitor learns Heretic: Good is on the brink of losing."
        ]
    },
    {
        "id": "priest",
        "name": "Priest",
        "team": "townsfolk",
        "ability": "Each night*, choose a player: if the Demon, you die. One good player registers as the Demon to your ability.",
        "reminders": [
            "Sinner"
        ],
        "preceedingOtherNightId": "acrobat",
        "otherNight": 17.5,
        "otherNightReminder": " The Priest points at another player.",
        "flavor": "Back, foul demon, BACK!",
        "overview": "The Priest dies if they encounter the Demon, or a specific good player.",
        "howtorun": "On the first night, decide a good player to register incorrectly to the Priest - mark them \"Sinner\". Each night besides the first, wake the Priest, and have them choose a player. If that player is the Demon, or the player marked \"Sinner\", the Priest dies.",
        "examples": [
            "The Priest chooses the Po: they die.",
            "The Priest chooses the Chambermaid: nothing happens.",
            "The Priest chooses the Saint, who has been elected the Priest's Sinner: the Priest dies."
        ]
    },
    {
        "id": "disruptor",
        "name": "Disruptor",
        "team": "townsfolk",
        "ability": "Executions fail if no Townsfolk voted. Evils know you are in play. [+0 or +1 Outsider]",
        "reminders": [
            "Townsfolk Voted",
            "About to Die"
        ],
        "setup": true,
        "preceedingFirstNightId": "poppygrower",
        "firstNight": 10.5,
        "firstNightReminder": "Evils learn the Disruptor is in play",
        "flavor": "Nobody said it was *wrong* to sabotage things.",
        "overview": "The Disruptor forces Townsfolk to have the say by failing nominations with no Townsfolk votes.",
        "howtorun": "On the first night, wake each evil player. Show them the \"This character chose you\" card, then the Disruptor token. Each nomination, if a Townsfolk voted, mark the Disruptor \"Townsfolk Voted\". When tallied, if the Disruptor is not marked \"Townsfolk Voted\", announce the player as about to die, but secretly they are not (the vote count is 0): mark the previous player \"About to Die\", to remember. At the end of the day, execute the player who was about to die.",
        "examples": [
            "The High Priestess, Recluse, and Yaggababble voted. The vote count is 3, as normal, and at the end of the day, the nominee is executed.",
            "Only the Saint, Scarlet Woman, and Evil Twin voted on a nomination. The vote count is 0, but is announced as 3. At the end of the day, another player is about to die, so they are executed as normal.",
            "Both Outsiders, all 3 Minions, and the Demon are the only voters on a nomination. The vote count is 0, but is announced as 6. At the end of the day, that player would be about to die, so the previous about to die player is executed instead."
        ]
    },
    {
        "id": "blackout",
        "name": "Blackout",
        "team": "outsider",
        "ability": "An alive good player is drunk, even if you are dead. Each day, guess who it is: if right, you are drunk until dawn & learn a true statement.",
        "reminders": [
            "Drunk",
            "Correct"
        ],
        "flavor": "Lot o' good that Soldier trainin' did ya! *I'm drunk!*",
        "overview": "The Blackout causes an alive good player to be drunk. However, each day they can guess it, they learn a true fact.",
        "howtorun": "On the first night, choose a good player to be drunk - mark them \"Drunk\". When that player dies, choose another. Each day, allow the Blackout to speak with you privately to name another player: if it is the player marked \"Drunk\", the Blackout is drunk until dawn, and whisper them a true statement - mark them \"Correct\", remove it at Dawn. Otherwise, send them away.",
        "examples": [
            "The Empath is drunk. The Blackout tells the Storyteller they think the Fortune Teller is drunk, and learn nothing.",
            "The Puzzlemaster is drunk. When they die, the General becomes drunk instead.",
            "The Alchemist is drunk. The Blackout tells the Storyteller they think the Alchemist is drunk, and learns the Demon is 3 steps from their nearest Minion. That night, the Alchemist's assasin kill goes through. The next day, they say the same, and learn that the Demon is an odd number of seats from them."
        ]
    },
    {
        "id": "plagued",
        "name": "Plagued",
        "team": "outsider",
        "ability": "Townsfolk that vote on your execution are drunk until tomorrow dusk, even if you are dead.",
        "reminders": [
            "Drunk",
            "Drunk",
            "Drunk"
        ],
        "flavor": "Don't touch me!",
        "overview": "Townsfolk that vote for the Plagued's execution are drunk until the next dusk.",
        "howtorun": "Each day, if the Plagued is nominated and any Townsfolk vote for the execution, they are drunk - mark them \"Drunk\". Each dusk, remove \"Drunk\" marks not placed today.",
        "examples": [
            "The Empath votes for the Plagued. That night, despite having an evil neighbour, they learn 0.",
            "The Slayer votes for the Plagued. The next day, they choose the Demon, but nothing happens."
        ]
    },
    {
        "id": "ra'atchet",
        "name": "Ra'atchet",
        "team": "minion",
        "ability": "On your 1st night, choose a direction: players register as their neighbour 1 step in that direction to Townsfolk abilities.",
        "reminders": [
            "Clockwise",
            "Anti-Clockwise"
        ],
        "preceedingFirstNightId": "xaan",
        "firstNight": 25.5,
        "firstNightReminder": "The Ra'atchet indicates a direction.",
        "flavor": "etB ouy ookedl pu hatw hist eantm.",
        "overview": "The Ra'atchet rotates the grimoire one step for Townsfolk abilities.",
        "howtorun": "On the first night, wake the Ra'atchet and let them indicate a direction - place the \"Clockwise\" or \"Anti-Clockwise\" in the centre of the Grimoire to remind you. Whenever a Townsfolk ability would learn information about or affect in any way a player, it instead affects their neighbour 1 step in the marked direction.",
        "examples": [
            "The Fortune Teller chooses the Demon and the Saint, their Red Herring. However, because the Ra'atchet registered each as their neighbour, they learn No.",
            "The Saint is executed. Good loses.",
            "The Spy learns the entire grimoire rotated 1 step clockwise.",
            "The Ra'atchet chooses Clockwise. That night, the Empath learns a 1 despite both their neighbours being good, as the player 2 steps clockwise from them is evil.",
            "The Ra'atchet chooses Anticlockwise. The Slayer shoots the Demon's anticlockwise neighbour, and the Demon dies."
        ],
        "tip": "This is quite hard to run."
    },
    {
        "id": "archeolos",
        "name": "Archeolos",
        "team": "minion",
        "ability": "You start by choosing another alive player to give this ability. This is your only ability (if Townsfolk), or this acts twice (if evil & given by good).",
        "reminders": [
            "Has Ability",
            "Has Ability",
            "Has Ability",
            "Has Ability",
            "Doubled",
            "Doubled"
        ],
        "preceedingFirstNightId": "poisoner",
        "preceedingOtherNightId": "poisoner",
        "firstNight": 26.5,
        "otherNight": 12.75,
        "firstNightReminder": "The Archeolos points at a player.",
        "otherNightReminder": "The players with the Archeolos ability point at a player, or 2 if they are evil and were given it by good.",
        "flavor": "Ok class, today we're going to see what these do. Catch!",
        "overview": "The Archeolos forces good players to play hot potato, hiding Townsfolk abilities, and doubling if a good player gives it to an evil player.",
        "howtorun": "Each night, wake all players with the Archeolos ability one by one, and get them to choose an alive player that isn't themselves: mark the new player \"Has Ability\", and if they are evil and the original player is good, mark them \"Doubled\". If they were marked \"Doubled\", make them choose twice.",
        "examples": [
            "The Archeolos chooses the Fortune Teller. That night, the Fortune Teller isn't woken for their ability. They then choose the Soldier; when the Demon chooses them later that night, the Soldier dies.",
            "The Saint with the Archeolos ability chooses the Po. The next night, the Po chooses the Empath and the Spy."
        ],
        "tip": "If more players have the ability than reminder tokens, use a notebook and pen."
    },
    {
        "id": "sorceror",
        "name": "Sorceror",
        "team": "minion",
        "ability": "Townsfolk nominations poison good nominees. Each night*, if none did, choose a player: they are poisoned until dusk.",
        "reminders": [
            "Townsfolk Nominated",
            "Chosen",
            "Poisoned",
            "Poisoned",
            "Poisoned",
            "Poisoned"
        ],
        "preceedingOtherNightId": "poisoner",
        "otherNight": 12.5,
        "otherNightReminder": "If no Townsfolk nominated today, the Sorceror points at a player.",
        "flavor": "To turn upon one's own must be punished.",
        "overview": "The Sorceror forces good to permanently poison other good players, or face a night of untrustworthy information.",
        "howtorun": "Each day, if a Townsfolk nominates a good player, that player is poisoned, and mark the Sorceror \"Townsfolk Nominated\". Each night besides the first, if the Sorceror is not marked \"Townsfolk Nominated\", wake them and let them choose a player. That player is poisoned until dusk, mark them \"Chosen\".",
        "examples": [
            "The Choirboy nominates the King. The King is poisoned.",
            "The Fortune Teller nominates the Snitch. The Snitch is poisoned.",
            "No Townsfolk nominated today. Tonight, the Sorceror wakes, and chooses the Fortune Teller: they choose the Saint and Empath, neither their red herring, but learn a yes."
        ]
    },
    {
        "id": "siren",
        "name": "Siren",
        "team": "demon",
        "ability": "Each night*, choose a player: they die. Outsiders you kill change alignment. [Outsiders might start evil, -1 to +1 Outsider]",
        "preceedingOtherNightId": "kazali",
        "otherNight": 49.875,
        "otherNightReminder": "The Siren points at a player.",
        "flavor": "They say you oughta dance like no one's watching\nThey’re a telepathic chorus in my mind",
        "overview": "The Siren makes some Outsiders evil, and changes their alignment upon killing them.",
        "howtorun": "Upon setup, you may add or remove one Outsider token from the bag, and decide which Outsiders are evil - wake them on the first night to inform them. Each night besides the first, waken the Siren, and let them choose a player - that player dies. If that player was an Outsider and they died, change their alignment and wake them to tell them their new alignment.",
        "examples": [
            "There should be 1 Outsider, but both the Saint and Zealot are in play. The Zealot is evil.",
            "When the Siren chooses the evil Recluse, they die and become good."
        ]
    },
    {
        "id": "destroyer",
        "name": "Destroyer",
        "team": "demon",
        "ability": "Each night*, you may choose a player & a direction: They & 2 players in that direction for every night you didn't kill die.",
        "reminders": [
            "Kill Length"
        ],
        "preceedingOtherNightId": "kazali",
        "otherNight": 49.75,
        "otherNightReminder": "The Destroyer points at a player and indicates a direction, or shakes their head.",
        "flavor": "Goodbye.",
        "overview": "The Destroyer can choose to hold off to kill more, but a night's kills must be in a line.",
        "howtorun": "Place the \"Kill Length\" marker on the Destroyer. Each night besides the first, wake them, and allow them to choose a player and indicate a direction, or shake their head. If they shake their head, rotate the \"Kill Length\" marker two steps clockwise. If they choose a player and direction, note how far the \"Kill Length\" marker is from the Destroyer: the chosen player and that many players in the chosen direction die. Then, place the \"Kill Length\" marker back on the Destroyer.",
        "examples": [
            "On the second night, the Destroyer chooses Clockwise and the Fortune Teller: they die.",
            "On the second night, the Destroyer chooses to hold. On the third night, they choose Clockwise and the Empath: the Empath and their 2 Clockwise neighbours die.",
            "The Destroyer has held for 3 nights. They choose their counterclockwise neighbour, the Alchemist, and counterclockwise. The Alchemist, and their 6 anticlockwise neighbours die."
        ]
    },
    {
        "id": "wrazcal",
        "name": "Wrazcal",
        "team": "demon",
        "ability": "Each night*, choose a player: learn how helpful killing them is to your team. Then, choose if they die. If not, tomorrow night, instead choose 2 player: they die.",
        "reminders": [
            "Twice"
        ],
        "preceedingOtherNightId": "kazali",
        "otherNight": 49.5,
        "flavor": "To kill or not to kill? I do so enjoy toying with my prey, but I get ever so hungry...",
        "overview": "The Wrazcal has the choice between a single kill, but they know how good a kill, or two blind kills on the next night.",
        "howtorun": "Each night besides the first, wake the Wrazcal. If they are marked \"Twice\", remove it, and let them choose 2 players: they die. Otherwise, let them choose a single player. Inform them from 0-5 how helpful killing that player is for the Wrazcal's team, then allow them to nod or shake their head. If they nod, that player dies. If they shake, mark them \"Twice\", and put them to sleep.",
        "examples": [
            "The Wrazcal chooses the Savant. They learn 4, and choose to kill them.",
            "The Wrazcal chooses the Saint. They learn 2, and choose to kill them.",
            "The Wrazcal chooses the Moonchild, who is Innnkeeper protected. They learn 0, and choose to hold off. Tomorrow night, they choose the Innkeeper and Pacifist, who both die."
        ]
    },
    {
        "id": "blessingofperfidy",
        "name": "Blessing of Perfidy",
        "team": "demon",
        "image": "https://github.com/QuorglepleegJr/PublishedBotCIcons/blob/master/BlessingOfPerfidy.png?raw=true",
        "ability": "After day 5, all but you are poisoned, & good wins if & only if the Storyteller is executed tomorrow. Good players killed by execution bring this 1 day sooner.",
        "reminders": [
            "Distortion Clock"
        ],
        "flavor": "Rise, my servants. Rise and serve me.",
        "overview": "The Blessing of Perfidy forces good players to execute the Storyteller on the 6th day... but this comes closer when a wrong execution is made.",
        "howtorun": "On the first night, place the \"Distortion Clock\" reminder 5 steps anticlockwise of the Blessing of Perfidy. At the end of each day, move this one step clockwise, or two if a good player died by execution today. If the \"Distortion Clock\" is on the Blessing of Perfidy (place it onto them if it goes past), all other players are poisoned. At the end of the next day, if the Storyteller was executed, good wins, otherwise evil does.",
        "examples": [
            "No good players died by execution. On the sixth night, the Empath learns a 1 when both their alive neighbours are good, and the Acrobat does not die when they choose the Drunk.",
            "No good players died by execution. On the sixth day, the Blessing of Perfidy is executed. Evil wins.",
            "1 good player died by execution. On the fifth day, the Storyteller was executed. Good wins."
        ]
    },
    {
        "id": "paradoxofmercy",
        "name": "Paradox of Mercy",
        "team": "demon",
        "image": "https://github.com/QuorglepleegJr/PublishedBotCIcons/blob/master/ParadoxOfMercy.png?raw=true",
        "ability": "After day 3, if all Minions live, evil wins. After day 5, evil wins.",
        "reminders": [
            "1st Day",
            "2nd Day",
            "Minions Failed"
        ],
        "jinxes": [
            {
                "id": "devilsadvocate",
                "reason": "If the Paradox of Mercy is in play, the Devil's Advocate may not choose themselves on the 3rd night."
            }
        ],
        "flavor": "Then, in the middle of all the chaotic cries, someone shouted: 'It's the beast! A big, scary monster lives in the black, dusky forest!'",
        "overview": "The Paradox of Mercy wins if all Minions live after day 3, or after day 5.",
        "howtorun": "When the day ends, if the Paradox of Mercy is unmarked, mark them \"1st Day\". If they're marked \"1st Day\", remove it and mark them \"2nd Day\". If they're marked \"2nd Day\" and not \"Minions Failed\", check if all Minions are alive: if so, evil wins, otherwise mark them \"Minions Failed\" and \"1st Day\". If they are marked both \"2nd Day\" and \"Minions Failed\", evil wins.",
        "examples": [
            "After the 3rd day, both the Baron and the Mastermind are alive: evil wins.",
            "On the 3rd day, the Devil's Advocate is executed and dies. The game continues.",
            "On the 3rd day, the Paradox of Mercy is executed and dies. Good wins.",
            "After the 3rd day, the Minion is dead. However, good fails to execute the Paradox of Mercy by the end of the 5th day, and evil wins."
        ]
    }
]